# The Redesign project - Jupyter notebook 

Import pandas to fetch the excel file saved on the local machine, downloaded from Koemna.com. 
Read the workbook and sheet1.

In [9]:
import pandas as pd

#Read the whole workbook
project1 = pd.ExcelFile(r"C:\Users\Tanushree\Desktop\UNIVERSITY\Quarter 4\Dashboard\Project1\Internet_Usage_Data.xlsx")

#Read the sheet1
sheet1 = pd.read_excel(r"C:\Users\Tanushree\Desktop\UNIVERSITY\Quarter 4\Dashboard\Project1\Internet_Usage_Data.xlsx",sheetname=0)

Display the name of the sheet i.e. ObservationData

In [10]:
read_sheet_names = project1.sheet_names
print(read_sheet_names,"\n")

['ObservationData']

Display the records 1 to 5 in sheet1

In [14]:
sheet1[1:5]

       Location Name      2000      2005   2010       2015
1  Congo (Dem. Rep.)  0.005902  0.238038   0.72   3.800000
2             Rwanda  0.062831  0.556041   8.00  18.000000
3              Ghana  0.153615  1.831197   7.80  31.447852
4            Algeria  0.491706  5.843942  12.50  38.200000

Drop the columns with unnecessary(not imparting any relevant info) information from the sheet.

In [15]:
drop1 = ['Location','Location RegionId','Variable','Variable Name','Variable Code_2','Variable Definition','Scale','Variable Unit','Units']
sheet1 = sheet1[[col for col in sheet1.columns if col not in drop1]]

Displaying selected rows by putting label

In [16]:
sheet1.loc[0:5]

       Location Name      2000      2005   2010       2015
0       Congo (Rep.)  0.026355  1.463420   5.00   7.615975
1  Congo (Dem. Rep.)  0.005902  0.238038   0.72   3.800000
2             Rwanda  0.062831  0.556041   8.00  18.000000
3              Ghana  0.153615  1.831197   7.80  31.447852
4            Algeria  0.491706  5.843942  12.50  38.200000
5       South Africa  5.348560  7.488543  24.00  51.919116

Rename column 'Location name' as 'COUNTRY'

In [18]:
sheet1=sheet1.rename(columns = {'Location Name' : 'COUNTRY'})

In [19]:
sheet1.loc[0:5]

             COUNTRY      2000      2005   2010       2015
0       Congo (Rep.)  0.026355  1.463420   5.00   7.615975
1  Congo (Dem. Rep.)  0.005902  0.238038   0.72   3.800000
2             Rwanda  0.062831  0.556041   8.00  18.000000
3              Ghana  0.153615  1.831197   7.80  31.447852
4            Algeria  0.491706  5.843942  12.50  38.200000
5       South Africa  5.348560  7.488543  24.00  51.919116

Drop the rows, not informational. Drop empty rows if all values of the rows are NaN.

In [20]:
sheet1.drop(sheet1.index[194:196])

sheet1 = sheet1.dropna(axis=0,how='all')

In [21]:
sheet1[0:5]

             COUNTRY      2000      2005   2010       2015
0       Congo (Rep.)  0.026355  1.463420   5.00   7.615975
1  Congo (Dem. Rep.)  0.005902  0.238038   0.72   3.800000
2             Rwanda  0.062831  0.556041   8.00  18.000000
3              Ghana  0.153615  1.831197   7.80  31.447852
4            Algeria  0.491706  5.843942  12.50  38.200000

Export the data to excel

In [22]:
# Create a Pandas Excel writer using XlsxWriter as the engine.
import pandas as pd
writer = pd.ExcelWriter('Cleaned_Internet.xlsx', engine='xlsxwriter')

# Convert the dataframe to an XlsxWriter Excel object.
sheet1.to_excel(writer, sheet_name='ObservationData')
# Close the Pandas Excel writer and output the Excel file.
writer.save()

sheet1.to_excel('Clean_Internet1.xlsx',sheet_name='ObservationData', index=False)